/////////////////////////////////////////////////////////////////////////////////////
//***********************************************************************************
//*   ----  [ \t\n]       ------  [a-zA-Z_]
//*   |  |                |    |
//*   |  v   [a-zA-Z_]    |    v            else
//*   --(0) -----------> (1)[Identifier] ------------> (0)
//*      |                                back output
//*      |   +-*/%^              =
//*      ---------------> (2) --------> (0)
//*      |     <>!     (2')|  output
//*      |                 |
//*      |                 | else operator
//*      |                 -----------> Error
//*      |                 |
//*      |                 |   else
//*      |                 -----------> (0)
//*      |                  back output
//*      |     &/|                 =
//*      ---------------> (3/4) --------> (0)
//*      |                  |
//*      |                  |    &/|             =
//*      |                  ------------> (5) ---------> (0)
//*      |                                 |    else
//*      |                                 ------------> Error/(0)
//*      |      =                 =
//*      ---------------> (6) ----------> (0)
//*
//*
//*
//***********************************************************************************
/////////////////////////////////////////////////////////////////////////////////////

#pragma once
#include <iostream>
#include "Misc.h"

using namespace std;

class Tokenizer {
public:
	Tokenizer(istream &ReadStream);		//从输入流中读取文本
	~Tokenizer();
	Tokenizer& operator>> (Token* token);		//使用operator>>输出到Token指针里，返回是否成功
	Token* getToken();
private:
	char nextChar;
	//bool noOperator;					//读取一个运算符后不能无空白紧接另一个非负号运算符 用不着
	//在此步分析减号与负号，左括号 左大括号 右大括号 冒号 分号 运算符 赋值后的"-"为负号，此外为减号
	bool willBeNegative;
	int lineNo;
	istream& const ReadStream;
};

